{
  "title": "How to integrate Strava into Slack",
  "slug": "strava-slack-integration",
  "date": "2021-02-04T16:18:19.856Z",
  "image": {
    "url": "/img/morning-jog.jpg",
    "alt": "Morning jog"
  },
  "description": "If like me you use Strava and want to brag about your latest PR with your coworker here's the best way I found to automatically post my results in Slack. Thanks Zapier!",
  "body": "## Zapier\nI'm not going to explain what's [Zapier](https://zapier.com/), they do it well enough by themselves. If you're not familiar with them go check it out, it's pretty useful to automate mundane tasks.\n\nIf you're too lazy to read this post and only want the Zap, I got something for you. Zapier now allows us to share Zaps. That's a super cool feature I wasn't aware of (until now). You probably will have to change one or two things but here is the end product I created for this post.\n\n[BRING ME TO THE THING NOW](https://zapier.com/shared/2e057cdc4e53ff1c3820ac910d17b0e01c9f9392)\n\nIf you don't have an account go ahead and create it, we're going to need it :)\n\n## Make a Zap\n\nFirst, you're going to need to create your Zap.\n\n[make a zap](/img/make-a-zap.jpg)\n\n### Trigger\n\nYou need to select the trigger. A trigger is the app + event combo that will start the Zap.\n\nIn our case, we'll select Strava.\n\n![select trigger app](/img/select-trigger-app.jpg)\n\nThen you can choose what event should start the Zap. We want to use `New Activity`.\n\n![select trigger event](/img/select-trigger-event.jpg)\n\nYou will be asked to log into your Strava account. Mine was already linked! \n\n![link strava account](/img/link-strava-account.jpg)\n\nThen, you can test the trigger. Zapier will pull the last event of this type and display the payload content. All those information will be available in the next step.\n\n![test trigger payload](/img/test-trigger-payload.jpg)\n\n### Action\n\nNow that we have a trigger, we need to choose what we want to do with it.\nI found that I always end up posting to Slack. This might be because my use cases are a bit trivial but you can come up with much more complex flows.\n\nHere, you're asked to select which app will react to the trigger. You could push your data into a spreadsheet to compile your results and maybe even pull the weather when you ran and find some sort of correlation between the temperature and your pace 🙃.\n\nFor now, let's just show off to our colleague. So I'll pick Slack.\n\n![select action app](/img/select-action-app.jpg)\n\nFor the event, we want to submit to a channel. Feel free to select `Direct message` to debug the Zap before sending it to a channel.\n\n⚠️ ** Please, don't send your results to any public channel such as #general ** ⚠️\n\n![select action event](/img/select-action-event.jpg)\n\nAs before, you will be asked to log into your Slack account. Mine was already linked (again)! \n\n![link slack account](/img/link-slack-account.jpg)\n\n### Config\n\nHere comes the fun part. This is also the part where you can go off-script if you'd like. These are just my personal preferences.\n\nThe message builder is quite intuitive. Try it! If you're too lazy you can always use the zap sharing link I've put at the top of the article.\n\nI picked the name of the activity, the distance, the duration, the pace and the URL so people can go five me _kudos_ 😍. Also, I picked send as a bot. But feel free to do otherwise.\n\n![configure zap](/img/configure-zap.jpg)\n\nAlso, I didn't like having the Zap link at the end of the message. Plus, we get the event emoji from Zapier. Let's use it.\n\n![advanced config](/img/advanced-config.jpg)\n\nIf you want to tag someone you will have to enable `Link Usernames and Channel Names` feature. Also, [check this](https://zapier.com/help/doc/tips-formatting-your-slack-messages#slack-announcements) if you want to learn why @username doesn't work. You have to dig a bit for that 🙃.\n\nI highly suggest that you tag yourself so people know who's record it is.\n\nIn my case, that would be by adding `<@UB7L6HMUL>` to my message.\n\n![link username](/img/link-username.jpg)\n\n## Release it\nWoops, don't forget to activate it 🙈.\n![turn it on](/img/turn-it-on.jpg)\n\n## Conclusion\nHere you go, you succeeded! Congrats :)\nFeel free to try out other triggers and action combinations.\n\n![see the result](/img/see-the-result.jpg)\n\n\n\n"
}