{
  "title": "I'm joining Capdesk",
  "slug": "joining-capdesk",
  "date": "2021-02-21T20:56:38.296Z",
  "image": {
    "url": "/img/passion-led-us-here.jpg",
    "alt": "Two persons' legs standing on concrete written passion led us here"
  },
  "description": "Three years later it's now time for me to seek new challenges.",
  "body": "## Farewell Fizzer\n\nWhat a ride. I'll forever be grateful for this opportunity. I think I can say there will always be a before and an after Fizzer in my life.\n\nI was lucky enough to find this amazing job. At 22, I got the chance to land my first remote job. And the odds I ever work again in an office are pretty low. This is the company that showed me that there's more to work than work. That it doesn't need to be mindless 9-to-5 schedules all the time.\n\nThis is the team with which I got to create a culture. I got to make decisions and be there at the inception of an engineering team. I had the chance to hire people and help shape the face of this startup. I invested myself to improve an existing product and make it my own a little. \n\nFor this fair bit of luck, I'm grateful.\n\nI grew into something better. I'm much more accomplished than I was before and much more confident in my own ability to build and thrive in any workplace.\n\n### Every good thing comes to an end \n\nI'm not the sentimental type. I try to look forward and not to have regrets. Still, I leave my colleagues of the last few years. I leave friends with whom I shared many Zoom calls (😂) and few European retreats. The pandemic shook our life and it's more than a year since I had the chance to meet them in person. That's leaves a bit of bitterness in my mouth.\n\nThank you very much, but it's now time for me to move onto the next chapter.\n\n## Hello Capdesk 😍\n\nAgain, life has its way. It's hard not to oversee the amount of luck required to land at such an amazing company. It was the right role, with the right team, at the right time. I'm beyond excited about the new challenges and opportunities I will face at Capdesk. It's with extreme pleasure that I accepted this role.\n\nI will join a highly skilled team in the equity revolution they started a few years ago. The hiring process was delightful and it's hard to overlook how committed they are to create a top-tier culture while hiring only the _cream of the crop_.\n\n<iframe class=\"ig-frame\" src=\"https://www.instagram.com/p/CKg0LURBas_/embed\" width=\"640\" min-height=\"745\" frameborder=\"0\" scrolling=\"no\" allowtransparency=\"true\"></iframe>\n\nI feel very lucky to get the chance to keep working remotely. Remote work has been a blessing in my life. I was somewhat worried that career progression would be harder (if not impossible) remotely. It's relieving to find growth (during a pandemic 🙃) and to keep everything I love about remote work. \n \nWhen I first interviewed with Guillaume (Capdesk's CTO) I saw someone who shares my beliefs about remote work. The team member I met convinced me that individual growth is part of their mindset. It made a lot of sense when I learned that **Togetherness** and **Empowerment** were two of their values. It's impossible to list everything but the whole _thing_ just feels right. The role, the culture, the people, ✨ everything ✨.\n \nI will keep improving my craft and further improve as a senior frontend engineer (yup, that's me 🏆) while working with some of the best engineers I've met in my career. As with every career changed I had, there's a healthy amount of stress (👋 [Impostor Syndrome](https://en.wikipedia.org/wiki/Impostor_syndrome)). I have found a group of human being willing to trust me 😅. I don't think I'll ever get used to it. And guess what? I'm going to prove them right 💪. I couldn't be happier.\n\n> I have written 11 books, but each time I think, 'Uh oh, they're going to find out now. I've run a game on everybody, and they're going to find me out.' - **Maya Angelou**\n\n \nTo my future self: **Godspeed**.\n "
}