{
  "title": "I'm joining Capdesk",
  "slug": "joining-capdesk",
  "date": "2021-02-21T20:56:38.296Z",
  "image": {
    "url": "/img/passion-led-us-here.jpg",
    "alt": "Two persons' legs standing on concrete written passion led us here"
  },
  "description": "Three years later it's now time for me to seek new challenges.",
  "body": "## Farewell Fizzer\n\nWhat a ride. I'll forever be grateful for this opportunity. I think I can say there will always be a before and an after Fizzer in my life.\n\nI was lucky enough to find this amazing job. At 22, I got the chance to land my first remote job. And the odds I ever work again in an office are pretty low. This is the company that showed me that there's more to work than work. That it doesn't need to be mindless 9-to-5 schedules all the time.\n\nThis is the team with which I got to create a culture. I got to make decisions and be there at the inception of an engineering team. I had the chance to hire people and help shape the face of this startup. I invested myself to improve an existing product and make it my own a little. \n\nFor this fair bit of luck, I'm grateful.\n\nI grew into something better. I'm much more accomplished than I was before and much more confident in my own ability to build and thrive in any workplace.\n\n### Every good thing comes to an end \n\nI'm not the sentimental type. I try to look forward and not to have regrets. Still, I leave my colleagues of the last few years. I leave friends with whom I shared many Zoom calls (😂) and few European retreats. The pandemic shook our life and it's more than a year since I had the chance to meet them in person. That's leaves a bit of bitterness in my mouth.\n\nThank you very much, but it's now time for me to move onto the next chapter.\n\n## Hello Capdesk 😍\n\nAgain, life has its way. I'm still not 100% certain how I got this new job. I deserve it, don't take me wrong! But it's hard not to oversee the amount of luck required to land at such an amazing company. \n\n"
}