{
  "title": "Moving Toward 2021",
  "slug": "moving-toward-2021",
  "date": "2021-01-02T18:07:39.502Z",
  "image": {
    "url": "/img/sunrise.jpg",
    "alt": "Sunrise with the shadow of a man in front of it"
  },
  "description": "It's the first time I try this exercise. It's time to wrap up 2020 and set sail toward 2021.",
  "body": "## 2020\n\nLast year, I left my hometown and I was supposed to spend the whole years abroad as a digital nomad. My first stop was Mexico City. I fell in love with the city and the culture. Destiny brought me back home as I could not travel to my next destination. France and Hungary were not accessible anymore due to the pandemic. So I went back home instead. This was a tough decision. I was worried about how bad things could go and decided that being close to my family was the right thing to do.\n\nI could have remained super demoralized. Trust me I was. But I decided to shift my sight to other objectives. I massively improve my cooking skills and I couldn't be happier about it. I really love cooking and I'm glad I can cook a great meal to share with my relatives. I learned lots of new tricks and I now try to cook almost everything by hand. Jam, pickles, sourdough, granola, mayonnaise, etc.\n\nSince I had enjoyed Mexico so much, I decided to continue Spanish learning at my local university. In total, I completed three classes and I happily consume _a lot of_ Latin American books, music and shows to further improve my skills.\n\nLet's not forget that this year I ran my first half-marathon, I ran 30k for fun on a sunny Sunday in September and I cumulated a total of 1200km on Strava. Cheers to that!\n\n## 2021\n\nAt the end of 2020, I decided to quit my self-imposed schedule of 60+ hours of coding. I worked on several side projects and wanted to slow down a bit. I started reading a lot. I was an avid reader as a kid but I stopped taking the time to do it at the end of highschool So that's my first goal for 2021. I want to read 52 books. At least one per week. This is an ambitious objective and I would be seriously happy if I managed to read at least 40 books. But I like challenges 🙃. I will also try to switch back and forth between non-fiction and fiction. If I can manage it, I'll read all my fiction books in Spanish to help improve my vocabulary.\n\nAlso, I would like to reach the 2000 km milestone this year. I started my Strava journey a bit late in 2020 and this should be easily achievable as I boasted an average of 42km per week in November and December.\n\nLast year, I integrated my Spotify and Github history into my website and I'll try to do the same with Goodread and Strava to have my personal stats panel.\n\n## Books\n\nHere is what I already read and what I'm currently reading. I'll try to update this often until I manage to integrate Goodreads or another system on my website :)\n\n* [Como agua para chocolate](https://www.amazon.ca/-/fr/Laura-Esquivel-ebook/dp/B004774D14) ✅\n* [That will never work](https://www.amazon.ca/-/fr/Marc-Randolph/dp/0316530204) ✅\n* [La casa de los espiritus](https://www.amazon.ca/-/fr/Isabel-Allende/dp/0525433473) ✅\n* [The Almanack of Naval Ravikant](https://www.amazon.ca/-/fr/Eric-Jorgenson/dp/1544514212) ✅\n* [Ficciones](https://www.amazon.ca/-/fr/Jorge-Luis-Borges/dp/0307950921) (❌ -- Too hard for now)\n* [The Art Of War](https://www.amazon.ca/-/fr/Sun-Tzu/dp/0486832945) ✅\n* [La vida que no elegí](https://www.amazon.ca/-/fr/Lorena-Franco-ebook/dp/B01ECP5TDG) ✅\n* [The 7 Habits of Highly Effective People](https://www.amazon.ca/-/fr/Stephen-R-Covey-ebook/dp/B01069X4H0/ref=lp_9351919011_1_2) ✅\n* [Quédate conmigo](https://www.amazon.ca/-/fr/Lorena-Franco-ebook/dp/B01EX6CMM0) ✅\n* [It Doesn't Have to Be Crazy at Work](https://www.amazon.ca/-/fr/Jason-Fried/dp/0062874780) ✅\n* [El último invierno](https://www.amazon.ca/-/fr/Encarna-Bernat/dp/1539847136) ✅\n* [Speed Reading](https://www.amazon.ca/-/fr/Justin-Hammond-ebook/dp/B008J2MMWU) ✅\n* [A Beginner's Guide to the Stock Market](https://www.amazon.ca/-/fr/Matthew-R-Kratter/dp/1099617200/) ✅\n* [The Insider's Guide to Culture Change](https://www.amazon.ca/-/fr/gp/product/B07T8S4TGY/ref=ppx_yo_dt_b_d_asin_title_o08?ie=UTF8&psc=1) ✅\n* [Cien años de soledad](https://www.amazon.ca/-/fr/Gabriel-GarcÍA-MÁRquez-ebook/dp/B00NKDOYHY) (READING)\n* [The Richest Man in Babylon](https://www.amazon.ca/-/fr/George-S-Clason-ebook/dp/B07H7HN6DN) ✅\n* [Private Equity](https://www.amazon.ca/gp/product/B079W2BGKS) (❌)\n* [How to avoid a climate disaster](https://www.amazon.ca/-/fr/Bill-Gates/dp/0735280444) ✅"
}