{
  "title": "When you need experience to gain experience",
  "slug": "experience-to-gain-experience",
  "date": "2020-10-02T22:42:40.969Z",
  "image": {
    "url": "/img/bowl-of-eggs.jpg",
    "alt": "Which came first: the chicken or the egg? ðŸ”ðŸ¥š"
  },
  "description": "Acquiring new skills takes time. Quite a lot, in some cases. How do you validate your skills in the tech industry? Do you really have to work with a tech stack for years to be hirable?",
  "body": "# Why such questions?\n> Which came first: the chicken or the egg?\n\nIs it a thought exercise or simply a fun question to blend philosophy and science? I don't really care. As of late, some interrogations started to hang out in the back of my mind. I wanted to share a little bit!\n\n> How do you acquire new tech skills? \n\nThis is actually a variance of an interview question I was asked when I joined [Fizzer](https://www.fizzer.com). The question was something like \"How do you master a technological stack\". Back then, I replied that you need to have worked with it for a while. This way you get enough experience to _master_ it. Seeing a wide array of problems and finding how to solve them is what gives you a better understanding of your stack.\n\nTo say that you master a stack is a pretty bold statement. And I would not dare to say that about myself. I have been working on the same product for two years as the sole developer. Yet, I'm far from perfect. I do make mistakes from time to time lots of the things I code are probably suboptimal. Since I'm working alone, I'm rarely challenged by others. I don't get a lot of opinions to help me refine my point of view. That's an issue. Code reviews are awesome. Try to get feedback on what you do!\n\nBack to what brought me here. If two years of working full time on a single stack didn't achieve me some sort of mastery, what could? And more so, the main question I'm worrying myself with these days:\n\n> How can one gain experience with a stack if he needs some experience to be hired in that stack?\n\nInteresting don't you think? If you didn't learn a skill through school (or a bootcamp) and aren't a junior hire anymore, how do you transition to a new stack? Let's say from Vue to React, Angular, etc.? It seems that to be hired in a new role one would need to have experience with that stack. Since I mentioned working with a stack is what makes you better at it... Things are getting tricky.\n\nThat's where mastering the basics is super important. I believe it's much more important to be skilled in let's say JavaScript than to know a lot about each JS framework. Lots of people do think the same. Yet, this might not always be visible in the recruitment process.\n\nAs I'm trying to progress in my career and improve myself, I'm looking for ways to gain new experience, demonstrate said experience and feel like I'm making progress.\n\n# How to gain experience\n\nCouple hours before writing this I read this [article](https://kentcdodds.com/blog/how-to-get-experience-as-a-software-engineer) by [Kent C. Dodds](https://twitter.com/kentcdodds). It brings interesting ideas about how to progress and become more experimented as a software engineer.\n\nTwo main takeaway: \n\n- You need to face issues, problems\n\n- Open source is a path toward gaining and demonstrating skills\n\n\nThat's interesting. No doubt, smooth seas never made a skilled sailor! But it can be hard to face real problems when you don't work on larger projects. I know I can't work on _fake_ side-projects for too long before losing interest. \n\nOne solution for that can be to work on smaller things like the little library I talked about in my last [post](https://maferland.com/blog/publishing-library-minimal-config). Bite-sized projects make it much easier to complete and feel like you achieved something. You can still gain very valuable knowledge by working on those. Plus they help build a little portfolio! \n\nBringing value to someone or generating any kind of public output makes it much more rewarding.\n\nContributing to open-source projects can be scary. Tackling simple problems you encounter is a nice way to build confidence and give you traction in the community. That's an area where I definitely want to improve.\n\n# Learning in public\n\n> [...] generating any kind of public output makes it much more rewarding\n\nAs I wrote this sentence, I thought of Shawn Wang's [Learn in public article](https://www.swyx.io/learn-in-public/). Go read it. Generating output, making stuff, having something to show. It makes you accountable, even if no one cares. \n\nThis blog post, might not need to be a blog post. But it's a way for me to learn in public. It helps me improve my writing skills. Putting things down helps me organize my thoughts and see more clearly where I'm heading. Being a better writer makes me a better communicator which makes me better at my job!\n\nIt gives me momentum. It makes me want to write tons of little projects, tons of little libraries. It makes me want to write other blog posts and keep learning!\n\n**Don't hide** what you're doing. I did that for a while. Try to release ASAP. Try to iterate, it'll give you momentum. It'll get you to solve harder challenges, to write more blog posts, to gain more momentum. It's a virtuous circle.\n\n# About learning in the tech industry\n\nJust want to note, that I feel like it's an industry where we are **required** to learn a lot outside of our job to stay relevant. Not everyone wants to spend dozens of extra hours outside of their job and it's perfectly normal. We need to normalize having hobbies and a healthy work-life balance!\n\nI feel blessed that I'm very motivated right now and that I have the time to invest myself in this kind of hobby. But we might want to reflect on this as an industry. I do get that we are well rewarded for our knowledge but 10x and rockstar dev lingo gives me headaches ðŸ˜†.\n\n# Wishful thinking\n\nRight now, I'm thinking I could write a Netlify CMS plugin to import images from Unsplash and resize/optimize them on the go. That would be super cool and it would make my blog writing workflow a little easier. \n\nCan anyone tell me why tech articles all start with a seemingly irrelevant image ðŸ™ƒ?\n\nI'll keep working on my [website](https://maferland.com).\n\nI'll try to give a little doc to my latest (and first?) [library](https://github.com/maferland/hooks)... Releasing doc-less code is bad. Not releasing anything is worse!\n\nAnd I will keep learning with [EpicReact.dev](epicreact.dev)\n\n## Keep reading ðŸ‘‡\n\nAnother nice article on the topic [Learn in public hack](https://www.swyx.io/learn-in-public-hack/) by [SWYX](https://twitter.com/swyx/)\n\n"
}